ACQUAINTANCE_FIRST_MESSAGE = (
    "Добро пожаловать в компанию!\n\n"
    "Я - виртуальный ассистент, который будет помогать Вам во время адаптации в нашей компании.\n\n"
    "Для начала немного поговорим о Вас.\n\n"
    "Пожалуйста напишите дату своего рождения в формате ДД.ММ.ГГГГ (например: 01.01.2001)"
)

ACQUAINTANCE_SECOND_MESSAGE = (
    "Отлично!\n\n"
    "У нас есть небольшая традиция - новоиспеченный сотрудник пишет кратенькую информацию о себе и своих увлечениях.\n"
    "Пожалуйста напишите о себе в свободной форме.\n"
    "Например, чем занимаетесь в свободное время, или о своих целях и устремлениях."
)


ACQUAINTANCE_ABOUT_US_MESSAGE = (
    "Спасибо, что рассказали о себе!\n\n"
    "Позвольте теперь рассказать немного о нас:\n\n"
    "<b>MYCEGO</b> - крупная компания, которая работает более 2 лет на рынке. "
    "Мы производим сувенирную продукцию и продаем её на маркетплейсах.\n\n"
    "<b>Наша специализация</b> - молодежные товары, которые дают людям почувствовать особую атмосферу - аниме-товары, "
    "мерч по K-POP, атрибутика по различным играм, манга, канцтовары. "
    "Мы заботимся о своих клиентах, стремимся предлагать качественный сервис, "
    'а также атмосферу, где каждый покупатель сможет почувствовать себя "своим".\n\n'
    "<b>В нашем управлении более 80000 SKU это ТОП бренды в своей нише:</b>\n"
    "✅ Аниме товары\n"
    "✅ Кружки\n"
    "✅ Постеры\n"
    "✅ Закатные значки\n"
    "✅ Наклейки\n"
    "✅ Сувениры\n\n"
    "Производство успешно работает в Новосибирске и Нижнем Новгороде,"
    "<b>бренд захватывает лидирующие позиции на маркетплейсах,</b>"
    "а мы просто с любовью развиваем наше дело, производя свой товар.\n\n"
    "<b>Наша цель</b> - создать самый крупный интернет магазин сувенирной продукции в России.\n\n"
    "<b>Компания MYCEGO</b> растет - каждый месяц появляется всё больше товаров нашего производства,"
    "поэтому мы набираем всё больше людей в нашу команду.\n\n"
    "<b>Коллектив MYCEGO</b> - люди, любящие свою работу."
    "Будем рады видеть новые лица в компании, которые смогут делать вклад в развитие нашего уютного мира!"
)

AFTER_ACQUAINTANCE_MESSAGE = (
    "В общем, ещё раз - добро пожаловать в команду <b>MYCEGO</b>!\n\n"
    "Отправляю меню для работы\n"
    "Оно появится либо вместо клавиатуры, либо в правой стороне поля ввода сообщения (квадрат, 4 точки).\n"
    "С помощью этого меню можно:\n"
    "Подавать/отменять заявки в график🗓\n"
    "Подавать/редактировать отчёт о проделанной работе🔨\n"
    "Просматривать свои расчётные листы💰 и статистику📊\n"
    "Подавать заявку🐧 на: отпуск, изменение графика или листа работ.\n\n"
    "Также есть стандартное меню с командами "
    '(можно вызвать нажав на кнопку со знаком "/" либо набрав этот знак в начале сообщения):\n'
    "/start - сбросить текущие операции и показать главное меню.\n"
    "/contacts - показать список важных контактов.\n"
    "/promo - показать условия промо-акций компании\n"
    "/career - показать карьерную лестницу\n"
    "/vacancies - показать список вакансий компании\n"
)

CAREER_PHOTO_PATH = "static/career.jpg"

PROMO_MESSAGE = (
    'Сейчас у нас действует акция "Приведи друга"\n\n'
    "<b>Условия:</b>\n"
    "Если от Вас приходит кандидат и отрабатывает в компании "
    "не менее 40 часов с ПЛАНОВОЙ эффективностью, то вы получаете бонус 2000 рублей💰🤑\n"
    "❗❗❗<b>Важно</b>❗❗❗\n"
    "Другу на собеседовании необходимо сообщить, что он именно от вас (назвать имя и фамилию)\n"
    "❌Если кандидат это не сообщит, то он не будет засчитан."
)

VACANCIES_LINK = '<a href="https://bryansk.hh.ru/search/vacancy?from=employerPage&employer_id=9553033">Наши вакансии</a>'
