ACQUAINTANCE_FIRST_MESSAGE = (
    "Добро пожаловать в компанию!\n\n"
    "Я - виртуальный ассистент, который будет помогать Вам во время адаптации в нашей компании.\n\n"
    "Для начала немного поговорим о Вас.\n\n"
    "Пожалуйста напишите дату своего рождения в формате ДД.ММ.ГГГГ (например: 01.01.2001)"
)

ACQUAINTANCE_SECOND_MESSAGE = (
    "Отлично!\n\n"
    "У нас есть небольшая традиция - новоиспеченный сотрудник пишет кратенькую информацию о себе и своих увлечениях.\n"
    "Пожалуйста напишите о себе в свободной форме.\n "
    "Например, чем занимаетесь в свободное время, или о своих целях и устремлениях."
)


ACQUAINTANCE_ABOUT_US = (
    "Спасибо, что рассказали о себе!\n\n"
    "Позвольте теперь рассказать немного о нас:\n\n"
    "<b>MYCEGO</b> - крупная компания, которая работает более 2 лет на рынке. "
    "Мы производим сувенирную продукцию и продаем её на маркетплейсах.\n\n"
    "<b>Наша специализация</b> - молодежные товары, которые дают людям почувствовать особую атмосферу - аниме-товары, "
    "мерч по K-POP, атрибутика по различным играм, манга, канцтовары. "
    "Мы заботимся о своих клиентах, стремимся предлагать качественный сервис, "
    "а также атмосферу, где каждый покупатель сможет почувствовать себя \"своим\".\n\n"
    "<b>В нашем управлении более 80000 SKU это ТОП бренды в своей нише:</b>\n"
    "✅ Аниме товары\n"
    "✅ Кружки\n"
    "✅ Постеры\n"
    "✅ Закатные значки\n"
    "✅ Наклейки\n"
    "✅ Сувениры\n\n"
    "Производство успешно работает в Новосибирске и Нижнем Новгороде,"
    "<b>бренд захватывает лидирующие позиции на маркетплейсах,</b>"
    "а мы просто с любовью развиваем наше дело, производя свой товар.\n\n"
    "<b>Наша цель</b> - создать самый крупный интернет магазин сувенирной продукции в России.\n\n"
    "<b>Компания MYCEGO</b> растет - каждый месяц появляется всё больше товаров нашего производства,"
    "поэтому мы набираем всё больше людей в нашу команду.\n\n"
    "<b>Коллектив MYCEGO</b> - люди, любящие свою работу."
    "Будем рады видеть новые лица в компании, которые смогут делать вклад в развитие нашего уютного мира!"
)