SURVEY_DISCLAIMER = "\n\n*** Во время опроса другие функции бота не доступны."

AFTER_FIRST_DAY_MESSAGE = (
    "🎉🎉Поздравляем с окончанием первого рабочего дня!🎉🎉\n\n"
    "Мы хотели бы узнать немного о том, как Вам у нас.\n"
    "Для этого, пожалуйста, ответьте на несколько простых вопросов (займёт буквально пару минут)."
)

FIRST_DAY_FIRST_QUESTION_MESSAGE = "Понравился ли Вам первый рабочий день?\n🧑‍💼🛠️⚙️"

FIRST_DAY_SECOND_QUESTION_MESSAGE = "Понятны ли задачи?\n🤔🖊️🤓"

FIRST_DAY_THIRD_QUESTION_MESSAGE = (
    "Считаете ли вы свое рабочее место комфортным/удобным?\n🗃️🛋️🏭"
)

FIRST_DAY_FIVE_STAR_MESSAGE = "Оцените по 5-ти бальной шкале:\n"
FIRST_DAY_FIVE_STAR_1 = "Взаимодействие с руководителем/помощником руководителя"
FIRST_DAY_FIVE_STAR_2 = "Атмосфера в коллективе"
FIRST_DAY_FIVE_STAR_3 = "Обучение тренера"
FIRST_DAY_FIVE_STAR_4 = "Условия работы"

AFTER_SURVEY_MESSAGE = (
    "Мы стараемся заботиться о наших сотрудниках, поэтому любое мнение для нас важно.\n"
    "Надеемся, что в будущем Вам будет комфортно и весело работать с нами!\n"
    "Спасибо за ответы и уделённое время!"
)

AFTER_FIRST_WEEK_MESSAGE = (
    "🎉🎉Вы с нами уже целую неделю!🎉🎉\n\n"
    "Надеемся, что Вам нравится с нами работать.\n"
    "Чтобы мы могли в этом убедиться, пожалуйста, ответьте на несколько вопросов."
)

FIRST_WEEK_FIVE_STAR_1 = "Как прошла первая рабочая неделя?"
FIRST_WEEK_FIVE_STAR_2 = "Хватает ли вам знаний для того чтобы их применять в работе?"
FIRST_WEEK_FIVE_STAR_3 = "Устроил ли вас уровень первой зарплаты?"

MONTHLY_MESSAGE = (
    "🎉🎉Прошёл {}-й месяц нашего сотрудничества!🎉🎉\n\n"
    "Нам важно знать Ваше мнение о нас.\n"
    "Пожалуйста, ответьте на несколько вопросов."
)

MONTHLY_FIRST_QUESTION = "Вы довольны своей работой?"
MONTHLY_SECOND_QUESTION = "Как вы оцениваете атмосферу в коллективе?"
MONTHLY_THIRD_QUESTION = (
    "Рекомендуете ли вы своим друзьям, знакомым, родственникам работу в нашей компании?"
)
MONTHLY_FOURTH_QUESTION = "Вас устраивает уровень дохода?"
MONTHLY_FIFTH_QUESTION = "Рассматриваете сейчас другие предложения о работе?"
MONTHLY_SIXTH_QUESTION = (
    "Что бы вы хотели изменить или предложить "
    "для улучшения работы в компании? (не считая зарплаты)\n"
    "Напишите своими словами (не более 2000 символов)"
)
