from aiogram import Dispatcher
from aiogram.fsm.context import FSMContext


async def send_second_month_questionary(user_id: int | str):
    ...
"""1. Вам понравился первый рабочий день?
-да
-не очень
-нет
2. Понятны ли задачи?
-да
-не очень
-нет
3. Считаете ли вы свое рабочее место комфортным/удобным?
-да
-не очень
-нет
4. Оцените по пятибальной шкале
-взаимодействие с руководителем/помощником руководителя (от 1 до 5)
-атмосфера в коллективе (от 1 до 5)
-обучение тренера (от 1 до 5)
-условия работы (от 1 до 5)"""

